src/DataProcessors/ОстановкаКанбанов/ОстановкаКанбанов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОстановкаКанбанов</name>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОстановки</name>
    <type>
      <types>CatalogRef.ПричиныОстановок</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Канбаны</name>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаОстановки</name>
      <type>
        <types>CatalogRef.ПричиныОстановок</types>
      </type>
    </attributes>
    <attributes>
      <name>Пометка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/InformationRegisters/ОстановкиКанбанов/ОстановкиКанбанов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОстановкиКанбанов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>Причина</name>
    <type>
      <types>CatalogRef.ПричиныОстановок</types>
    </type>
  </attributes>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ПростойЛинейки/ПростойЛинейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПростойЛинейки</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Остановка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Окончание</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Причина</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ПричиныОстановок</types>
    </type>
  </resources>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ОборотКанбанов/ОборотКанбанов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОборотКанбанов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ДатаПринятия</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПередачи</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Оформил</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>Принял</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>Передал</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>Завершил</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>Аналог</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаЗамены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХраненияОтправитель</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЯчейки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/МаршрутнаяКарта/МаршрутнаяКарта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МаршрутнаяКарта</name>
  <basedOn>Document.ЗаказНаПроизводство</basedOn>
  <basedOn>Document.РемонтнаяКарта</basedOn>
  <basedOn>Document.СписаниеМПЗПрочее</basedOn>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыНаПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.ПланыВыпуска</registerRecords>
  <registerRecords>AccumulationRegister.ПередачиВПроизводство</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.РемонтнаяКарта</types>
      <types>DocumentRef.СписаниеМПЗПрочее</types>
      <types>DocumentRef.ЗаявкаОтПокупателя</types>
      <types>DocumentRef.МаршрутнаяКарта</types>
      <types>DocumentRef.ЗаказНаПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерОчереди</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛинейкаИнициатор</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияПотребитель</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЯчейки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Счёт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ремонт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаОстановки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПредполагаемогоОкончанияОстановки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияОстановки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнициаторОстановки</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>МПЗОстановки</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОстановки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтандартныйКомментарий</name>
    <type>
      <types>CatalogRef.СтандартныеКомментарии</types>
    </type>
  </attributes>
  <attributes>
    <name>Выгружено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Аналоги</name>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НормаРасходов</name>
      <type>
        <types>CatalogRef.НормыРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналогНормыРасходов</name>
      <type>
        <types>CatalogRef.АналогиНормРасходов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТехОперации</name>
    <attributes>
      <name>ТехОперация</name>
      <type>
        <types>CatalogRef.ТехОперации</types>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Остановки</name>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияПредполагаемая</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Причина</name>
      <type>
        <types>CatalogRef.ПричиныОстановок</types>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Инициатор</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>РабочееМесто</name>
      <type>
        <types>CatalogRef.РабочиеМестаЛинеек</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ПроизводственноеЗадание/ПроизводственноеЗадание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроизводственноеЗадание</name>
  <posting>Deny</posting>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.МаршрутнаяКарта</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерОчереди</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратнаяТара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БарКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗапуска</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаГрупповойУпаковки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛинияSMD</name>
    <type>
      <types>CatalogRef.ЛинииSMD</types>
    </type>
  </attributes>
  <attributes>
    <name>Остановлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Выгружено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Перемещено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Испытания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СторонняяПоверка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Партия</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Аналоги</name>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НормаРасходов</name>
      <type>
        <types>CatalogRef.НормыРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналогНормыРасходов</name>
      <type>
        <types>CatalogRef.АналогиНормРасходов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Оборудование</name>
    <attributes>
      <name>ТехОперация</name>
      <type>
        <types>CatalogRef.ТехОперации</types>
      </type>
    </attributes>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>CatalogRef.ТехОснастка</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Канбаны</name>
    <attributes>
      <name>Изделие</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>МТК</name>
      <type>
        <types>DocumentRef.МаршрутнаяКарта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Прессформы</name>
    <attributes>
      <name>Станок</name>
      <type>
        <types>CatalogRef.ТехОснастка</types>
      </type>
    </attributes>
    <attributes>
      <name>Прессформа</name>
      <type>
        <types>CatalogRef.ТехОснастка</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/DataProcessors/ОстановкаКанбанов/Forms/Форма/Module.bsl
&НаСервере
Процедура ОстановитьНаСервере()
	Если Не ЗначениеЗаполнено(Объект.ПричинаОстановки) Тогда
	Сообщить("Выберите причину остановки!");
	Возврат;
	КонецЕсли;
Запрос = Новый Запрос;
 
	Попытка
	НачатьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция + 1;
		Для каждого ТЧ Из Объект.Канбаны Цикл
			Если ТЧ.Пометка Тогда
            Остановки = РегистрыСведений.ОстановкиКанбанов.СоздатьМенеджерЗаписи();
			Остановки.Период = ТекущаяДата();
			Остановки.Подразделение = Объект.Подразделение;
			Остановки.МПЗ = ТЧ.МПЗ;
			Остановки.Причина = Объект.ПричинаОстановки;
			Остановки.Записать();
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ПростойЛинейки.Период,
				|	ПростойЛинейки.Линейка,
				|	ПростойЛинейки.Причина,
				|	ПростойЛинейки.Примечание
				|ИЗ
				|	РегистрСведений.ПростойЛинейки КАК ПростойЛинейки
				|ГДЕ
				|	ПростойЛинейки.Причина = &Причина
				|	И ПростойЛинейки.Окончание = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";
			Запрос.УстановитьПараметр("Причина", ТЧ.МПЗ);
			РезультатЗапроса = Запрос.Выполнить();
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ОстановкаЛинейки = РегистрыСведений.ПростойЛинейки.СоздатьМенеджерЗаписи();
				ОстановкаЛинейки.Период = ВыборкаДетальныеЗаписи.Период;
				ОстановкаЛинейки.Линейка = ВыборкаДетальныеЗаписи.Линейка;
				ОстановкаЛинейки.Причина = ТЧ.МПЗ;
				ОстановкаЛинейки.Примечание = ВыборкаДетальныеЗаписи.Примечание;
				ОстановкаЛинейки.Остановка = Ложь;
				ОстановкаЛинейки.Окончание = ТекущаяДата();
				ОстановкаЛинейки.Записать(Истина);
				КонецЦикла;
			КонецЕсли; 
		КонецЦикла; 
	ЗафиксироватьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;Если ПараметрыСеанса.АктивнаТранзакция = 0 тогда СРМ_ОбменВебСервис.ОтправкаПослеТранзакции();КонецЕсли;	
	ОстановкаПриИзмененииНаСервере();
	Исключение
	Сообщить(ОписаниеОшибки());
	ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);	
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура СнятьОстановкуНаСервере()
Запрос = Новый Запрос;
Запрос1 = Новый Запрос;

	Попытка
	НачатьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция + 1;	
		Для каждого ТЧ Из Объект.Канбаны Цикл
			Если ТЧ.Пометка Тогда
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ОстановкиКанбанов.Период,
				|	ОстановкиКанбанов.Подразделение,
				|	ОстановкиКанбанов.МПЗ,
				|	ОстановкиКанбанов.Причина
				|ИЗ
				|	РегистрСведений.ОстановкиКанбанов КАК ОстановкиКанбанов
				|ГДЕ
				|	ОстановкиКанбанов.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|	И ОстановкиКанбанов.МПЗ = &МПЗ";
			Запрос.УстановитьПараметр("МПЗ",ТЧ.МПЗ);
			РезультатЗапроса = Запрос.Выполнить();
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	          	Остановки = РегистрыСведений.ОстановкиКанбанов.СоздатьМенеджерЗаписи();
				Остановки.Период = ВыборкаДетальныеЗаписи.Период;
				Остановки.Подразделение = ВыборкаДетальныеЗаписи.Подразделение;
				Остановки.МПЗ = ВыборкаДетальныеЗаписи.МПЗ;
				Остановки.Причина = ВыборкаДетальныеЗаписи.Причина;
		        Остановки.ДатаОкончания = ТекущаяДата();
				Остановки.Записать(Истина);
				Запрос1.Текст = 
					"ВЫБРАТЬ
					|	МаршрутнаяКарта.Ссылка
					|ИЗ
					|	Документ.МаршрутнаяКарта КАК МаршрутнаяКарта
					|ГДЕ
					|	МаршрутнаяКарта.ИнициаторОстановки = &ИнициаторОстановки
					|	И МаршрутнаяКарта.МПЗОстановки = &МПЗОстановки
					|	И МаршрутнаяКарта.ДатаОкончанияОстановки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";
				Запрос1.УстановитьПараметр("ИнициаторОстановки",Объект.Подразделение);
				Запрос1.УстановитьПараметр("МПЗОстановки",ВыборкаДетальныеЗаписи.МПЗ);
				РезультатЗапроса1 = Запрос1.Выполнить();
				ВыборкаМТК = РезультатЗапроса1.Выбрать();
					Пока ВыборкаМТК.Следующий() Цикл
					Статус = 0;
					ВыборкаПЗ = Документы.ПроизводственноеЗадание.Выбрать(,,Новый Структура("ДокументОснование",ВыборкаМТК.Ссылка));	
						Пока ВыборкаПЗ.Следующий() Цикл
							Если ВыборкаПЗ.ДатаЗапуска <> Дата(1,1,1) Тогда
							Статус = 1;
							КонецЕсли;
						Прервать;			
						КонецЦикла;
					МТК = ВыборкаМТК.Ссылка.ПолучитьОбъект();
					МТК.ДатаОкончанияОстановки = ТекущаяДата();
					МТК.Статус = Статус;
					МТК.Записать(РежимЗаписиДокумента.Проведение);
					КонецЦикла;
				КонецЦикла;
			КонецЕсли; 
		КонецЦикла;
	ЗафиксироватьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;Если ПараметрыСеанса.АктивнаТранзакция = 0 тогда СРМ_ОбменВебСервис.ОтправкаПослеТранзакции();КонецЕсли;	
	ОстановкаПриИзмененииНаСервере();
	Исключение
	Сообщить(ОписаниеОшибки());
	ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);	
	КонецПопытки; 
КонецПроцедуры

&НаКлиенте
Процедура ОстановкаПриИзменении(Элемент)
ОстановкаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОстановкаПриИзмененииНаСервере()
Объект.Канбаны.Очистить();
Запрос = Новый Запрос;
Запрос1 = Новый Запрос;

	Если Остановка = 1 Тогда
	Элементы.Обработать.Заголовок = "Остановить";
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОборотКанбанов.МПЗ КАК МПЗ
		|ИЗ
		|	РегистрСведений.ОборотКанбанов КАК ОборотКанбанов
		|ГДЕ
		|	ОборотКанбанов.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|	И ОборотКанбанов.МПЗ.Канбан.Подразделение = &Подразделение
		|ИТОГИ ПО
		|	МПЗ";
	Запрос.УстановитьПараметр("Подразделение",Объект.Подразделение);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаМПЗ = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаМПЗ.Следующий() Цикл
		Запрос1.Текст = 
			"ВЫБРАТЬ
			|	ОстановкиКанбанов.МПЗ,
			|	ОстановкиКанбанов.Причина
			|ИЗ
			|	РегистрСведений.ОстановкиКанбанов КАК ОстановкиКанбанов
			|ГДЕ
			|	ОстановкиКанбанов.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|	И ОстановкиКанбанов.МПЗ = &МПЗ";
		Запрос1.УстановитьПараметр("МПЗ",ВыборкаМПЗ.МПЗ);
		РезультатЗапроса1 = Запрос1.Выполнить();
			Если РезультатЗапроса1.Пустой() Тогда
			ТЧ = Объект.Канбаны.Добавить();
			ТЧ.МПЗ = ВыборкаМПЗ.МПЗ;			
			КонецЕсли; 				
		КонецЦикла;		
	Иначе
	Элементы.Обработать.Заголовок = "Снять остановку";
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстановкиКанбанов.МПЗ,
		|	ОстановкиКанбанов.Причина
		|ИЗ
		|	РегистрСведений.ОстановкиКанбанов КАК ОстановкиКанбанов
		|ГДЕ
		|	ОстановкиКанбанов.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТЧ = Объект.Канбаны.Добавить();
		ТЧ.МПЗ = ВыборкаДетальныеЗаписи.МПЗ;
		ТЧ.ПричинаОстановки = ВыборкаДетальныеЗаписи.Причина;
		КонецЦикла;	
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Остановка = 1;
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
ОстановкаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Обработать(Команда)
	Если Остановка = 1 Тогда
		Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		ОстановитьНаСервере();
		КонецЕсли; 
	Иначе
	СнятьОстановкуНаСервере();
	КонецЕсли;
КонецПроцедуры
